# LIVE Coding PAndas

In [1]:
import pandas as pd
import numpy as np
import datetime as d

In [53]:
df = pd.read_table("http://bit.ly/movieusers", sep="|",
                   header=None,
                   names=["index", "age", "sexe", "metier", "matricule"],
                   index_col="index")

In [ ]:
df.tail(10)

In [16]:
df.head(10)

       age sexe         metier matricule
index
1       24    M     technician     85711
2       53    F          other     94043
3       23    M         writer     32067
4       24    M     technician     43537
5       33    F          other     15213
6       42    M      executive     98101
7       57    M  administrator     91344
8       36    M  administrator     05201
9       29    M        student     01002
10      53    M         lawyer     90703

In [ ]:
df.shape

In [4]:

df.describe()

df.shapedf.describe().loc["age"]
df[["age", "sexe"]]

# indice location
df.iloc[0]
#  meme resultat avec
df.iloc[0, :]
#  1 ligne
df.iloc[1, :]
#  de 0 à 5
df.iloc[0:5, 1]

#  avec location
df.loc[2:5, "sexe"]


df["age"].dtype()
# autre solution
df.age.dtypes

df
age = df.age.astype("float")

# creer une nouvelle colonne
annee_actuelle = d.datetime.now().year
df["date_de naissance"] = annee_actuelle-df["age"]


# boucle
for index, ligne in df.iterrows:
    print(index, ":", ligne.age, ligne.metier, ligne.sexe)

# autre solution boucle
for index, linge in df.items:
    print(index, ":", ligne.age, ligne.metier, ligne.sexe)

# parcours d'une serie
for ligne in df.metier:
    print(ligne)

AttributeError: 'DataFrame' object has no attribute 'shapedf'

In [23]:
# boucle
for index, lignes in df.items():
    print(index)

age
sexe
metier
matricule

In [18]:
for index, element in df.iterrows():
    if element.metier == "writer":
        print(index, element.metier, element.age, element.matricule)

3 writer 23 32067
21 writer 26 30068
22 writer 25 40206
28 writer 32 55369
50 writer 21 52245
122 writer 32 22206
196 writer 49 55105
199 writer 30 17604
201 writer 27 E2A4H
236 writer 44 53214
264 writer 36 90064
293 writer 24 60804
370 writer 52 08534
385 writer 36 10003
389 writer 44 83702
390 writer 42 85016
392 writer 52 59801
445 writer 21 92653
464 writer 60 94583
491 writer 43 53711
498 writer 26 55408
503 writer 50 27514
504 writer 40 92115
507 writer 18 28450
518 writer 49 99709
548 writer 51 95468
557 writer 30 11217
558 writer 56 63132
617 writer 27 11201
620 writer 18 81648
668 writer 29 10016
695 writer 26 38115
736 writer 48 94618
741 writer 25 63108
745 writer 42 55113
772 writer 50 27105
796 writer 32 33755
798 writer 40 64131
801 writer 22 92154
829 writer 48 80209
833 writer 34 90019
842 writer 40 93055
853 writer 49 40515
896 writer 28 91505
911 writer 37 53210

In [ ]:
df[df.metier == "writer"]

In [15]:
df[(df.metier == "writer") & (df.sexe == "F")]

       age sexe  metier matricule
index
122     32    F  writer     22206
236     44    F  writer     53214
264     36    F  writer     90064
389     44    F  writer     83702
390     42    F  writer     85016
491     43    F  writer     53711
503     50    F  writer     27514
504     40    F  writer     92115
507     18    F  writer     28450
518     49    F  writer     99709
557     30    F  writer     11217
558     56    F  writer     63132
617     27    F  writer     11201
620     18    F  writer     81648
668     29    F  writer     10016
736     48    F  writer     94618
796     32    F  writer     33755
798     40    F  writer     64131
911     37    F  writer     53210

In [ ]:
df[(df.metier == "writer") | (df.metier == "technician")]

In [25]:
df[(df.age > 20)]

       age sexe         metier matricule
index
1       24    M     technician     85711
2       53    F          other     94043
3       23    M         writer     32067
4       24    M     technician     43537
5       33    F          other     15213
...    ...  ...            ...       ...
938     38    F     technician     55038
939     26    F        student     33319
940     32    M  administrator     02215
942     48    F      librarian     78209
943     22    M        student     77841

[834 rows x 4 columns]

In [24]:
df.sort_values(by="age", ascending=False)

       age sexe         metier matricule
index
481     73    M        retired     37771
803     70    M  administrator     78212
767     70    M       engineer     00000
860     70    F        retired     48322
585     69    M      librarian     98501
...    ...  ...            ...       ...
880     13    M        student     83702
609     13    F        student     55106
289     11    M           none     94619
471     10    M        student     77459
30       7    M        student     55436

[943 rows x 4 columns]

In [26]:
df.sort_values(by=["age", "sexe"], ascending=False)

       age sexe         metier matricule
index
481     73    M        retired     37771
767     70    M       engineer     00000
803     70    M  administrator     78212
860     70    F        retired     48322
559     69    M      executive     10022
...    ...  ...            ...       ...
609     13    F        student     55106
674     13    F        student     55337
289     11    M           none     94619
471     10    M        student     77459
30       7    M        student     55436

[943 rows x 4 columns]

In [28]:
#  inplace
df2=df.copy()
df2.sort_values(by=["age", "sexe"], ascending=False, inplace=True)
df2

       age sexe         metier matricule
index
481     73    M        retired     37771
767     70    M       engineer     00000
803     70    M  administrator     78212
860     70    F        retired     48322
559     69    M      executive     10022
...    ...  ...            ...       ...
609     13    F        student     55106
674     13    F        student     55337
289     11    M           none     94619
471     10    M        student     77459
30       7    M        student     55436

[943 rows x 4 columns]

In [40]:
df2[df2.sexe =="F"].sort_values(by="age").head(10).describe()

             age
count  10.000000
mean   14.500000
std     1.080123
min    13.000000
25%    14.000000
50%    14.500000
75%    15.000000
max    16.000000

In [45]:
df2=df2.iloc[1, :1]
df2

age    70
Name: 767, dtype: object

In [44]:
# suppression 2 lignes
df2.drop([481, 600])
df2

       age sexe         metier matricule
index
481     73    M        retired     37771
767     70    M       engineer     00000
803     70    M  administrator     78212
860     70    F        retired     48322
559     69    M      executive     10022
...    ...  ...            ...       ...
609     13    F        student     55106
674     13    F        student     55337
289     11    M           none     94619
471     10    M        student     77459
30       7    M        student     55436

[943 rows x 4 columns]

In [ ]:
df2.drop(["age","metier"], axis=1, inplace=False)

In [54]:
# df.head(10)
df3=df.copy()
df.sexe.str.replace(["M":"Homme"], ["F":"femme"] )

SyntaxError: invalid syntax (4216820475.py, line 3)

In [55]:
df3["sexe replace"]=df3.sexe.str.replace("M","Homme", "F","femme" )

NameError: name 'df3' is not defined

In [61]:
df3["sexe"].replace({
      ["M":"Homme"],
      ["F":"femme"]
      })

SyntaxError: invalid syntax (3533182842.py, line 2)